{
  "_name_or_path": "bert-base-cased",
  "architectures": [
    "WeightedBertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-geo",
    "2": "I-geo",
    "3": "B-gpe",
    "4": "I-gpe",
    "5": "B-per",
    "6": "I-per",
    "7": "B-org",
    "8": "I-org",
    "9": "B-tim",
    "10": "I-tim",
    "11": "B-art",
    "12": "I-art",
    "13": "B-eve",
    "14": "I-eve",
    "15": "B-nat",
    "16": "I-nat"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-art": 11,
    "B-eve": 13,
    "B-geo": 1,
    "B-gpe": 3,
    "B-nat": 15,
    "B-org": 7,
    "B-per": 5,
    "B-tim": 9,
    "I-art": 12,
    "I-eve": 14,
    "I-geo": 2,
    "I-gpe": 4,
    "I-nat": 16,
    "I-org": 8,
    "I-per": 6,
    "I-tim": 10,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
